In [8]:
# Libraries to help with reading and manipulating data
import numpy as np
import pandas as pd

# Libraries to help with data visualization
import matplotlib.pyplot as plt
import seaborn as sns

# to restrict the float value to 3 decimal places
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [9]:
# importing the primary dataset
path = 'C:\\Users\\Ishaan Shakti\\Documents\\Great Lakes\\11 - Marketing & Retail Analytics\\Project Work - Main\\dataset_group.csv'
data = pd.read_csv(path)

## DATA OVERVIEW

In [11]:
data.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [16]:
data.tail()

             Date  Order_id            Product
20636  25-02-2020      1138               soda
20637  25-02-2020      1138       paper towels
20638  26-02-2020      1139               soda
20639  26-02-2020      1139  laundry detergent
20640  26-02-2020      1139            shampoo

In [19]:
data.shape

(20641, 3)

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [31]:
#Checking the statistical summary of the data frame
data.describe().T

             count    mean     std   min     25%     50%     75%      max
Order_id 20641.000 575.986 328.557 1.000 292.000 581.000 862.000 1139.000

In [25]:
#Check for null values
data.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64

In [28]:
#Check for duplicate entries
data.duplicated().sum()

4730